#-*- coding: utf-8 -*-

##24. Δημιουργήστε ένα πρόγραμμα το οποίο θα προσομοιώνει τη λειτουργία
##μιας στοίβας.  Θα εμφανίζει ένα μενού με επιλογές 1 εισαγωγή-push
##2 εξαγωγή-pop 3 εκτύπωση  4 έξοδος. Ο χρήστης θα επιλέγει 1 έως 4
##και ανάλογα θα εκτελείται η αντίστοιχη λειτουργία μέχρι ο χρήστης να επιλέξει
##έξοδο. Δηλώστε τις απαραίτητες συναρτήσεις για τη στοίβα
##όπως ορίζονται στο βιβλίο σας. 

def Push(L,x):
    L.append(x)

def Pop(L):
    return L.pop()

def isEmpty(L):
    return len(L) == 0

def createStack():
    return []
    

print '''Επιλέξτε:\n
1 για εισαγωγή
2 για εξαγωγή
3 για εκτύπωση
4 για έξοδος\n'''

ep = int(input("Δώστε την επιλογή σας: "))

A = createStack()
while ep != 4:
    if ep == 1:
        num = raw_input("Δώστε στοιχείο για εισαγωγή: ")
        Push(A,num)
    elif ep == 2:
        if not isEmpty(A):
            Pop(A)
    else:
        print A
    ep = int(input("Δώστε την επιλογή σας: "))

print "ΤΕΛΟΣ ΠΡΟΓΡΑΜΜΑΤΟΣ"
            
