#-*- coding: utf-8 -*-

##23. Γράψτε ένα πρόγραμμα σε python το οποίο θα διαβάζει λέξεις μέχρι να δοθεί
##η τελεία.  Οι λέξεις που έχουν λιγότερα από δύο γράμματα θα αγνοούνται.
##Λέξεις που έχουν δύο ή περισσότερα γράμματα αντιγράφονται σε μία νέα λίστα
##μόνο το πρώτο και τελευταίο τους γράμμα.  Στο τέλος εμφανίζεται η νέα λίστα
##με τις λέξεις των δύο γραμμάτων. Παράδειγμα: Αν μου δοθεί λέξη λέξη η φράση
##“καλή χρονιά και καλά Χριστούγεννα σε όλους”  θα δημιουργηθεί η λίστα
##[‘κή’,’χα’,’κι’,’κα’’Χα’,’ός’] 

L = [] 
word = raw_input("Δώσε μία λέξη. Για τέλος δώσε '.': ")
while word != ".":
    while len(word) < 2:
        word = raw_input("Δώσε λέξη με παρπάνω από δύο γράμματα: ")
    L.append(word[0]+word[-1])
    word = raw_input("Δώσε μία λέξη. Για τέλος δώσε '.': ")
print L
    
    



