#-*- coding: utf-8 -*-

##19. Γράψτε μία συνάρτηση σε python η οποία θα δέχεται
##ως όρισμα μία λίστα από αριθμούς (πιθανόν καθένας από
##αυτούς να εμφανίζεται περισσότερες από μία φορά)
##και θα επιστρέφει μία λίστα όπου κάθε αριθμός
##εμφανίζεται μόνο μία φορά δηλαδή θα αφαιρεί
##τυχόν διπλοεγγραφές 

import random

def clearList(L):
    "Αφαιρεί τις διπλοεγγραφές από τη λίστα"
    C = []
    for item in L:
        if item not in C:
            C.append(item)
    return C

A = [18, 18, 17, 14, 14, 9, 9, 15]

print clearList(A)



