#-*- coding: utf-8 -*-

##25. Δημιουργήστε ένα πρόγραμμα το οποίο θα προσομοιώνει τη λειτουργίας
##μιας ουράς.  Θα εμφανίζει ένα μενού με επιλογές 1 εισαγωγή-enqueue
##2 εξαγωγή-dequeue 3 εκτύπωση  4 έξοδος. Ο χρήστης θα επιλέγει
##1 έως 4 και ανάλογα θα εκτελείται η αντίστοιχη λειτουργία
##μέχρι ο χρήστης να επιλέξει έξοδο. Δηλώστε τις απαραίτητες
##συναρτήσεις για τη ουρά όπως ορίζονται στο βιβλίο σας.


def Enqueue(L,x):
    L.append(x)
def Dequeue(L):
    return L.pop(0)
def isEmpty(L):
    return len(L) == 0
def createQueue():
    return []

print '''Επιλέξτε:\n
1 για εισαγωγή
2 για εξαγωγή
3 για εκτύπωση
4 για έξοδος\n'''

A = createQueue()
ep = int(input("Δώστε την επιλογή σας: "))

while ep != 4:
    if ep == 1:
        el = raw_input("Δώστε στοιχείο για εισαγωγή: ")
        Enqueue(A,el)
    elif ep == 2:
        Dequeue(A)
    else:
        print A
    ep = int(input("Δώστε την επιλογή σας: "))
print "ΤΕΛΟΣ ΠΡΟΓΡΑΜΜΑΤΟΣ"
    
